tap "adoptopenjdk/openjdk"
tap "derailed/k9s"
tap "etopeter/tap"
tap "gabrie30/utils"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jzelinskie/faq"
tap "k14s/tap"
tap "kaos/shell"
tap "peak/tap"
tap "pgpx/download-apache-tomcat"
tap "pgpx/paul"
tap "pulumi/tap"
tap "sambadevi/powerlevel9k"
tap "thezoraiz/ascii-image-converter"
tap "weaveworks/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Simple, modern, secure file encryption
brew "age"
# Flexible lightweight test report tool
brew "allure"
# Java build tool
brew "ant"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Easily rotate your AWS access key
brew "aws-rotate-key"
# Official Amazon AWS command-line interface
brew "awscli"
# Azure Storage data transfer utility
brew "azcopy"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Gnome disk usage analyzer
brew "baobab"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Statistics utility to count lines of code
brew "cloc"
# Command-line tool to manage cert-manager
brew "cmctl"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Diff your Docker containers
brew "container-diff"
# Container Signing
brew "cosign"
# Terminal countdown timer
brew "countdown"
# Tool for interacting with remote images and registries
brew "crane"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Git for data science projects
brew "dvc"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go version management
brew "goenv", args: ["HEAD"]
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tool for glamorous shell scripts
brew "gum"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Istio configuration command-line utility
brew "istioctl"
# Cross-platform Java Version Manager
brew "jabba"
# Manage your Java environment
brew "jenv"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Convert JSON and JSON Lines to terminal, CSV, HTTP, and markdown tables
brew "jtbl"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Kubernetes Native Policy Management
brew "kyverno"
# Lazier way to manage everything docker
brew "lazydocker"
# Sophisticated file transfer program
brew "lftp"
# Synchronize local directories with remote targets
brew "lsyncd"
# Customize your git commit hashes!
brew "lucky-commit"
# Personal Knowledge Management System for the LSP
brew "markdown-oxide"
# Java-based project management
brew "maven"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# NCurses Disk Usage
brew "ncdu"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Finds secrets and sensitive information in textual data and Git history
brew "noseyparker"
# Modern shell for the GitHub era
brew "nushell"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Open source distributed and RESTful search engine
brew "opensearch"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# PNG file optimizer
brew "optipng"
# Terminal User Interface (TUI) to view & control docker containers
brew "oxker"
# Program for transforming PDF files
brew "paperjam"
# Parallel gzip
brew "pigz"
# Python dependency management tool
brew "pipenv"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Python package management tool
brew "poetry"
# Generate locked-down AWS IAM Policies
brew "policy_sentry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Cloud native development platform
brew "pulumi"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# QR Code generation
brew "qrencode"
# Simple, modern, secure file encryption
brew "rage"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Safe, concurrent, practical language
brew "rust"
# Build tool for Scala projects
brew "sbt"
# Command-line tool to manage Scala environments
brew "scalaenv"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Data wrangler with jq-like query language
brew "sq"
# Cross-shell prompt for astronauts
brew "starship"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Log file highlighter
brew "tailspin"
# Tool to detect and prevent secrets from getting checked in
brew "talisman"
# Secrets management tool for developers
brew "teller"
# Tool to build, change, and version infrastructure
brew "terraform"
# HTTP/HTTPS proxy for POSIX systems
brew "tinyproxy"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Language for application scale JavaScript development
brew "typescript"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Tool for working with usage-spec CLIs
brew "usage"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Terminal navigator
brew "walk"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Command-line fuzzy finder that prioritizes matches on filenames
brew "zf"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# kubectl plugin to show cluster CPU and Memory requests utilization
brew "etopeter/tap/kubectl-view-utilization"
# Quickly clone an entire org/users repositories into one directory
brew "gabrie30/utils/ghorg"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Format Agnostic jQ
brew "jzelinskie/faq/faq"
# Common assertions for Bats
brew "kaos/shell/bats-assert"
# Common filesystem assertions for Bats
brew "kaos/shell/bats-file"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@9.0.34"
# A swiss army knife for Pulumi development
brew "pulumi/tap/pulumictl"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# App to write and organise your ideas
cask "capacities"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# 3D parametric modeller
cask "freecad"
# Terminal built on web technologies
cask "hyper"
# Vector graphics editor
cask "inkscape"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Automatically ejects external drives
cask "jettison"
# Kubernetes IDE
cask "lens"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Minimal installer for conda
cask "miniconda"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Programmable solid 3D CAD modeller
cask "openscad"
# Podcast platform
cask "pocket-casts"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# MySQL/MariaDB database management
cask "sequel-ace"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Terminal emulator, SSH and serial client
cask "tabby"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Utility for extracting text from images, videos, QR codes and barcodes
cask "viz"
# Network protocol analyzer
cask "wireshark"
# Create diagrams manually, or import external data for analysis
cask "yed"
# Video communication and virtual meeting platform
cask "zoom"
whalebrew "directory"
