tap "adoptopenjdk/openjdk"
tap "derailed/k9s"
tap "etopeter/tap"
tap "gabrie30/utils"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "jesseduffield/lazydocker"
tap "jzelinskie/faq"
tap "k14s/tap"
tap "kaos/shell"
tap "pgpx/download-apache-tomcat"
tap "pgpx/firefox"
tap "sambadevi/powerlevel9k"
tap "skanehira/docui"
tap "weaveworks/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Java build tool
brew "ant"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Easily rotate your AWS access key
brew "aws-rotate-key"
# Official Amazon AWS command-line interface
brew "awscli"
# Gnome disk usage analyzer
brew "baobab"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# Statistics utility to count lines of code
brew "cloc"
# Diff your Docker containers
brew "container-diff"
# Tool for interacting with remote images and registries
brew "crane"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr", link: false
# TUI Client for Docker
brew "docui"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Go version management
brew "goenv", args: ["HEAD"]
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Istio configuration command-line utility
brew "istioctl"
# Cross-platform Java Version Manager
brew "jabba"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Validate Kubernetes configuration files, supports multiple Kubernetes versions
brew "kubeval"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Lazier way to manage everything docker
brew "lazydocker"
# Sophisticated file transfer program
brew "lftp"
# Synchronize local directories with remote targets
brew "lsyncd"
# Java-based project management
brew "maven"
# Command-line interface (CLI) for mermaid
brew "mermaid-cli"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# NCurses Disk Usage
brew "ncdu"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Modern shell for the GitHub era
brew "nushell"
# Kubernetes introspection tool for developers
brew "octant"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# PNG file optimizer
brew "optipng"
# Python dependency management tool
brew "pipenv"
# Draw UML diagrams
brew "plantuml"
# Cloud native development platform
brew "pulumi"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Rsync for cloud storage
brew "rclone"
# Build tool for Scala projects
brew "sbt"
# Command-line tool to manage Scala environments
brew "scalaenv"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# HTTP/HTTPS proxy for POSIX systems
brew "tinyproxy", restart_service: true
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Network settings helper
brew "whatmask"
# Process YAML documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# kubectl plugin to show cluster CPU and Memory requests utilization
brew "etopeter/tap/kubectl-view-utilization"
# Quickly clone an entire org/users repositories into one directory
brew "gabrie30/utils/ghorg"
# Format Agnostic jQ
brew "jzelinskie/faq/faq"
# Kapp
brew "k14s/tap/kapp"
# Common assertions for Bats
brew "kaos/shell/bats-assert"
# Common filesystem assertions for Bats
brew "kaos/shell/bats-file"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@7.0.100"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@7.0.30"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@7.0.57"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@7.0.69"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@7.0.81"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@7.0.90"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@7.0.96"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@7.0.99"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@8.0.30"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@8.0.38"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@8.5.53"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@9.0.33"
# Download Apache Tomcat
brew "pgpx/download-apache-tomcat/download-apache-tomcat@9.0.34"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Text editor
cask "atom"
# Two-factor authentication software
cask "authy"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "firefox-45"
cask "font-meslo-for-powerline"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# Vector graphics editor
cask "inkscape"
# Java IDE by JetBrains
cask "intellij-idea"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Legacy runtime for the Java programming language
cask "java6"
# Automatically ejects external drives
cask "jettison"
# Visual user interface for Docker Container management
cask "kitematic"
# Kubernetes IDE
cask "lens"
# Office suite
cask "libreoffice"
# Slicer for Resin 3D printers
cask "lycheeslicer"
# Open-source, self-hosted Slack-alternative
cask "mattermost"
# Visual diff and merge tool
cask "meld"
# GitLab mirror - Graphical OpenConnect client (beta phase)
cask "openconnect-gui"
# Programmable solid 3D CAD modeller
cask "openscad"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video chat, voice call and instant messaging application
cask "skype"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Free and open-source OpenVPN client
cask "tunnelblick"
# MSLA/DLP, file analysis, calibration, repair, conversion and manipulation
cask "uvtools"
# Development environment
cask "vagrant"
# Open-source code editor
cask "visual-studio-code"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Create diagrams manually, or import external data for analysis
cask "yed"
